//=============================================================================
//
// アイテムUI処理 [ItemUI.h]
// Author : Gokan akane
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"
#include "Game.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_ITEMUI "data\\TEXTURE\\UI\\Item000.png"		// 読み込むテクスチャファイル名
#define	TEXTURE_ITEMUI1 "data\\TEXTURE\\UI\\Item005.png"	// 読み込むテクスチャファイル名
#define MAX_HEIGTH (6)										//窓を積む高さ
#define MAX_ITEMUITEX (2)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitItemUI(void);
void UninitItemUI(void);
void UpdateItemUI(void);
void DrawItemUI(void);
#endif
