//=============================================================================
//
// 背景処理 [Result.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _RESULT_H_ //二十インクルード防止のマクロ定義
#define _RESULT_

#include "main.h"
#include "Game.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
