//=============================================================================
//
// 背景処理 [Title.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _TITLE_H_ //二十インクルード防止のマクロ定義
#define _TITLE_

#include "main.h"

//*****************************************************************************
// 構造体
//*****************************************************************************
typedef enum
{
	ROGO_NONE = 0,		// 何もしていない状態
	ROGO_FLASH,			// ENTER入力状態
	ROGO_MAX
} RogoState;

typedef struct
{
	D3DXCOLOR col;
	float nChangeArpha;//透明度変更
	bool bAnim;

}RogoAnim;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif
