//=============================================================================
//
// 背景処理 [TUTORIAL.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _TUTORIAL_H_ //二十インクルード防止のマクロ定義
#define _TUTORIAL_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);
#endif
