//=============================================================================
//
// ドラグーン処理 [Doragon.h]
// Author : Gokan Akane
//
//=============================================================================
#ifndef _DORAGON_H_
#define _DORAGON_H_

#include "main.h"
#include "playerBase.h"
//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;
//*****************************************************************************
// クラス（派生）ドラグーン
//*****************************************************************************
class CDoragon : public CPlayer
{
public:
	CDoragon();
	~CDoragon();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	int m_nCntSkillTime;
};

#endif