//=============================================================================
//
// 星が降るエフェクト処理 [FallStar.cpp]
// Author : Gokan Akane
//
//=============================================================================
#include "renderer.h"
#include "scene.h"
#include "scene2D.h"
#include "manager.h"
#include "effectBase.h"
#include "fallStarEffect.h"
#include "playerBase.h"

//=============================================================================
// 静的メンバ変数
//=============================================================================

//*****************************************************************************
// ▽class CFallStar
//*****************************************************************************
//=============================================================================
// コンストラクタ
//=============================================================================
CFallStar::CFallStar()
{
	m_move = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_size = 0.0f;
	m_fAngle = 0.0f;
	m_col = D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f);
}
//=============================================================================
// デストラクタ
//=============================================================================
CFallStar::~CFallStar() {}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CFallStar::Init(void)
{
	CEffect::Init();

	/* 移動量を個別に決定 */
	float fmove = float(rand() % 3 + 1);
	m_move.y = fmove;

	/* サイズを個別に決定 */
	m_size = float(rand() % 30 + 2);

	/* 回転速度を個別に決定 */
	m_fAngle = float(rand() % 5 + 1);
	m_fAngle *= 0.01f;

	/* 色を個別にランダムに決定 */
	float fColR = float(rand() % 10 + 1);
	float fColG = float(rand() % 10 + 1);
	float fColB = float(rand() % 10 + 1);
	fColR *= 0.1f;
	fColG *= 0.1f;
	fColB *= 0.1f;
	m_col = D3DXCOLOR(fColR, fColG, fColB, 1.0f);

	/* テクスチャをランダムに決定 */
	m_nRandTex = rand() % 4;

	return S_OK;
}
//=============================================================================
// 終了処理
//=============================================================================
void CFallStar::Uninit(void)
{
	CEffect::Uninit();
}
//=============================================================================
// 更新処理
//=============================================================================
void CFallStar::Update(void)
{
	m_pos.y += m_move.y;

	CEffect::SetPos(m_pos);
	CScene2D::SetRotation(m_size, m_size, m_fAngle);
	CScene2D::SetColor(m_col);
	CScene2D::SetAnimX(4, 1, m_nRandTex);
}
//=============================================================================
// 描画処理
//=============================================================================
void CFallStar::Draw(void)
{
	CEffect::Draw();
}
