//=============================================================================
//
// シーン2Dポリゴン処理 [scene2d.h]
// Author : 
//
//=============================================================================
#ifndef _MAGICEFFECT_H
#define _MAGICEFFECT_H

#include "main.h"
#include "effectBase.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス(魔法使用中のエフェクト)
//*****************************************************************************
class CMagicEffect : public CEffect
{
public:
	CMagicEffect();
	~CMagicEffect();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static void SetMagicEffect(D3DXVECTOR3 pos);	//エフェクトを8回生成する関数

private:
	void Set(int nId);		//飛ばす角度を設定
	static int m_nIndex;	//エフェクトの番号 
	D3DXVECTOR3 m_move;

};
#endif
