//=============================================================================
//
// リザルトスコア処理 [ResultScore.h]
// Author : Gokan Akane
//
//=============================================================================
#ifndef _RESULTSCORE_H
#define _RESULTSCORE_H

#include "main.h"
#include "scoreBase.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNumber;
//*****************************************************************************
// クラス（派生）
//*****************************************************************************
class CResultScore : public CScore
{
public:
	CResultScore();
	~CResultScore();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetLastScore(int nScore);

private:
	CNumber *m_apNumber[MAX_DIGIT];
	float m_Alpha;
	D3DXCOLOR m_col;
};
#endif