//=============================================================================
//
// 弾処理 [Bow.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _BOW_H_
#define _BOW_H_

#include "main.h"
//*****************************************************************************
// 構造体定義
//*****************************************************************************

typedef struct
{
	D3DXVECTOR3 pos;//位置
	D3DXVECTOR3 move;//移動量
	int type;
	int nLife;//弓の寿命
	bool bUse;//使っているかどうか

}Bow;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBow(void);
void UninitBow(void);
void UpdateBow(void);
void DrawBow(void);
void SetBow(D3DXVECTOR3 pos, D3DXVECTOR3 move,int type);

Bow*GetBow(void);
#endif
