//=============================================================================
//
// フェード処理 [fade.h]
// Author : Gokan Akane
//
//=============================================================================
#ifndef _FADE_H_
#define _FADE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_POLYGON (2)
#define VTX_POS_X (0)
#define VTX_POS_Y (0)

//*************************************
// フェードの状態
//*************************************
typedef enum
{
	FADE_NONE = 0,		// 何もしていない状態
	FADE_IN,			// フェードイン状態
	FADE_OUT,			// フェードアウト状態
	FADE_MAX
} FADE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitFade(MODE modeNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);

void SetFade(MODE modeNext);
FADE GetFade(void);

#endif
