//=============================================================================
//
// 背景処理 [InterFase.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _INTERFASE_H_ //二十インクルード防止のマクロ定義
#define _INTERFASE_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitInterFase(void);
void UninitInterFase(void);
void UpdateInterFase(void);
void DrawInterFase(void);
#endif
