//=============================================================================
//
// 背景処理 [Mist.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _MIST_H_ //二十インクルード防止のマクロ定義
#define _MIST_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MIST_TEXTUER  "data\\TEXTURE\\BG\\mist.png" //読み込むテクスチャ
#define MIST_POS_X (0)					   //背景左上X
#define MIST_POS_Y (500)					   //背景左上Y
#define MAX_TEX  (2)					   //テクスチャの枚数
#define MIST_MOVE (3.0f)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMist(void);
void UninitMist(void);
void UpdateMist(void);
void DrawMist(void);
#endif
