//=============================================================================
//
// 背景処理 [Mist.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _MIST_H_ //二十インクルード防止のマクロ定義
#define _MIST_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMist(void);
void UninitMist(void);
void UpdateMist(void);
void DrawMist(void);
#endif
