//=============================================================================
//
// ポーズ背景処理 [PauseBG.h]
// Author :Gokan Akane
//
//=============================================================================
#ifndef _PAUSEBG_H_ //二十インクルード防止のマクロ定義
#define _PAUSEBG_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PAUSE_TEXTUER "data\\TEXTURE\\BG\\pauseBG.png" //読み込むテクスチャ
#define PAUSE_POS_X (280 + 150)					    //ポーズ背景左上X
#define PAUSE_POS_Y (280 - 80)					    //ポーズ背景左上Y
#define PAUSE_WIDTH (640 + 150)					    //ポーズ背景の幅
#define PAUSE_HEIGHT (640 - 80)					    //ポーズ背景高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPauseBG(void);
void UninitPauseBG(void);
void UpdatePauseBG(void);
void DrawPauseBG(void);
#endif
