//=============================================================================
//
// 背景処理 [PauseBG.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _PAUSEBG_H_ //二十インクルード防止のマクロ定義
#define _PAUSEBG_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPauseBG(void);
void UninitPauseBG(void);
void UpdatePauseBG(void);
void DrawPauseBG(void);
#endif
