//=============================================================================
//
// タイトル処理 [Title.h]
// Author :Gokan Akane
//
//=============================================================================
#ifndef _TITLE_H_ //二十インクルード防止のマクロ定義
#define _TITLE_

#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif
