//=============================================================================
//
// 背景処理 [TitleBG.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _TITLEBG_H_ //二十インクルード防止のマクロ定義
#define _TITLEBG_

#include "main.h"

//*****************************************************************************
// 構造体
//*****************************************************************************
typedef struct
{
	D3DXCOLOR col;
	int nCntAnim;	//アニメーションカウンター
	int PatternAnim;//アニメーションパターン

}BGAnim;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleBG(void);
void UninitTitleBG(void);
void UpdateTitleBG(void);
void DrawTitleBG(void);

#endif
